{
  "backend/main.mo": "Defines the backend actor with user profiles, likes, matches, messages, blocking, reporting, and access control plus query/update methods for frontend use.",
  "feature_evidence.json": "Lists implemented features, associated frontend files, components, and test coverage for authentication, messaging, safety tools, and core app pages.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend pages, hooks, layout components, and utilities for project documentation.",
  "frontend/index.css": "Global Tailwind-based style definitions with OKLCH color variables and light/dark theme support.",
  "frontend/index.html": "Main HTML entrypoint that loads the React application mount point and main script.",
  "frontend/src/App.tsx": "Sets up routing, authentication guard, theme provider, and navigation structure for all app pages.",
  "frontend/src/components/layout/AuthedShell.tsx": "Authenticated layout with header, navigation, mobile nav, and footer wrapping all protected pages.",
  "frontend/src/components/profile/PhotoCarousel.tsx": "Image carousel component allowing users to navigate through profile photos with arrows and indicators.",
  "frontend/src/components/profile/PhotoManager.tsx": "Manages up to five photo URLs with add, remove, and reorder controls, displaying each photo in a list.",
  "frontend/src/components/safety/BlockButton.tsx": "Provides a confirmation dialog to block a user via mutateAsync and triggers optional success handling.",
  "frontend/src/components/safety/ReportDialog.tsx": "Displays a dialog for reporting a user with selectable reasons and optional notes, submitting via useReportUser.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity authentication using AuthClient, including login state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, discovery, matches, messaging, and user actions using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes across the app.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/ConversationPage.tsx": "Displays a chat UI for a selected user, loads messages, marks them read, and allows sending new messages.",
  "frontend/src/pages/DiscoveryPage.tsx": "Shows recommended profiles for swiping with like/pass actions and handles profile setup requirements and navigation.",
  "frontend/src/pages/EditProfilePage.tsx": "Provides a form to edit and save the user’s profile including photos, bio, preferences, and personal details.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with marketing content and login via Internet Identity that redirects authenticated users to discovery.",
  "frontend/src/pages/MatchesPage.tsx": "Lists matches and sent likes, with navigation to profiles and conversations.",
  "frontend/src/pages/MessagesInboxPage.tsx": "Shows conversation previews from matches and navigates to individual chat threads.",
  "frontend/src/pages/OnboardingPage.tsx": "Form page for creating a user profile with fields, photo upload management, validation, and profile submission using React Query.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page showing blocked users and providing account logout functionality via Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing features, requirements, state versioning, and image asset needs."
}