{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Free dating site frontend (II auth, profiles, discovery, matches, messaging)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement Internet Identity sign-in and gate all dating features behind authentication, leaving a public landing page.",
      "acceptanceCriteria": [
        "Unauthenticated users can view a public landing page but cannot access discovery, likes, matches, or messages.",
        "Authenticated users are recognized by their Internet Identity principal and stay signed in across refreshes (until they sign out)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the app router/layout: a public Landing route plus authenticated-only routes for onboarding, discovery, matches, messages, profile, and settings. Use the authorization component guidance to require login before rendering protected routes and to avoid showing restricted data to guests. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AuthGuard.tsx",
          "operation": "create",
          "description": "Add an AuthGuard wrapper that uses useInternetIdentity to detect authentication, redirects guests to Landing, and shows a friendly Access Denied state for unauthorized attempts. Use the authorization component guidance for handling auth state and traps gracefully. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "create",
          "description": "Add a Login/Logout button using useInternetIdentity; on logout call React Query queryClient.clear() to clear cached personal data as required by the authorization component guidance. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AuthedShell.tsx",
          "operation": "create",
          "description": "Create an authenticated layout shell (header + nav) that only renders inside AuthGuard and displays branding plus navigation to Discovery/Matches/Messages/Profile/Settings."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement non-real-time messaging UI for matched users (inbox, conversation history, send messages) using on-demand fetch/polling.",
      "acceptanceCriteria": [
        "A user can only send messages to a matched user; attempts without a match fail.",
        "Messages are stored and can be retrieved in chronological order.",
        "Inbox view shows each match, last message snippet, and an unread indicator/count per match."
      ],
      "file_operations": [
        {
          "path": "frontend/src/api/messages.ts",
          "operation": "create",
          "description": "Create React Query hooks/mutations for messaging capabilities (getConversation, sendMessage, markConversationAsRead) backed by the actor from useActor, with user-friendly error mapping."
        },
        {
          "path": "frontend/src/pages/MessagesInboxPage.tsx",
          "operation": "create",
          "description": "Implement the inbox view using React Query (derive matches list, last message preview, unread counts from backend data), with loading/error/empty states and navigation into a conversation thread."
        },
        {
          "path": "frontend/src/pages/ConversationPage.tsx",
          "operation": "create",
          "description": "Implement a conversation thread view for a selected match: load chronological history, allow sending messages, and mark as read on open. Use polling via React Query refetchInterval (no WebSockets)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire Messages routes: inbox route and conversation route (e.g., parameterized by otherUser principal string) under AuthGuard so guests cannot access them."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add block and report UX: block users from discovery/messaging and submit reports with reason and optional note.",
      "acceptanceCriteria": [
        "After blocking, neither user can message the other and neither appears in the other’s discovery results.",
        "Users can submit a report against another profile with a selected reason and optional details; reports are stored in the backend."
      ],
      "file_operations": [
        {
          "path": "frontend/src/api/safety.ts",
          "operation": "create",
          "description": "Create React Query hooks/mutations for safety features (blockUser, getBlockedUsers, reportUser) and expose friendly error states."
        },
        {
          "path": "frontend/src/components/safety/ReportDialog.tsx",
          "operation": "create",
          "description": "Create a reusable report dialog UI (reason select + optional note) that calls the report mutation and provides success/failure feedback in English."
        },
        {
          "path": "frontend/src/components/safety/BlockButton.tsx",
          "operation": "create",
          "description": "Add a block action component that triggers blockUser mutation and updates relevant cached queries (discovery, matches/messages lists) via React Query invalidation."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "create",
          "description": "Implement a Settings page section for viewing the block list (read-only list of principals/profiles where available), and include sign out. Include loading/error/empty states for the block list."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create core frontend pages and navigation: landing, onboarding/create profile, edit profile, discovery swipe/cards, matches, messages, settings.",
      "acceptanceCriteria": [
        "Users can navigate between the core pages via a consistent header/tab navigation when signed in.",
        "Discovery provides Like/Pass actions and immediately advances to the next profile after an action.",
        "Matches and Messages pages are accessible only when signed in."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "create",
          "description": "Create a public landing page with branding, hero image, and a clear call-to-action to sign in (no private data shown)."
        },
        {
          "path": "frontend/src/pages/OnboardingPage.tsx",
          "operation": "create",
          "description": "Create an onboarding/create profile page that collects required profile fields and calls the backend update/save flow; include terms/consent gating UI (see REQ-11)."
        },
        {
          "path": "frontend/src/pages/EditProfilePage.tsx",
          "operation": "create",
          "description": "Create an edit profile page that loads the current user profile and allows updates to all editable fields including photos and interests."
        },
        {
          "path": "frontend/src/pages/DiscoveryPage.tsx",
          "operation": "create",
          "description": "Create a discovery swipe/card UI: load recommended profiles and provide Like/Pass actions that immediately advance to the next card; include access to report/block actions."
        },
        {
          "path": "frontend/src/pages/MatchesPage.tsx",
          "operation": "create",
          "description": "Create a matches list page that displays matches with basic profile info and navigates into messaging."
        },
        {
          "path": "frontend/src/pages/MessagesInboxPage.tsx",
          "operation": "create",
          "description": "Implement the inbox page (route wiring handled in App); include navigation into a conversation."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Ensure Settings includes sign out and block list access, and is reachable from the signed-in navigation."
        },
        {
          "path": "frontend/src/components/layout/AuthedNav.tsx",
          "operation": "create",
          "description": "Create a consistent header/tab navigation component for signed-in users that links to Discovery/Matches/Messages/Profile/Settings, showing the generated logo for branding."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire all required routes and ensure signed-in pages render within AuthedShell and AuthGuard; keep Landing as the only public page."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Use React Query for all backend calls with consistent loading/empty/error states and retry.",
      "acceptanceCriteria": [
        "All data-fetching views display a loading state while requests are in-flight.",
        "Failures display a non-technical, user-facing error message in English and allow retry.",
        "Empty states exist for: no profile yet, no discovery results, no matches, no messages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/api/profile.ts",
          "operation": "create",
          "description": "Add React Query hooks for current user profile (getCallerUserProfile), other profiles (getUserProfile as needed), and updateProfile/saveCallerUserProfile mutations, including cache invalidation and friendly error mapping."
        },
        {
          "path": "frontend/src/api/discovery.ts",
          "operation": "create",
          "description": "Add React Query hooks for discovery feed (getRecommendedProfiles with optional filters) and mutations for like/pass actions, with invalidation and user-friendly errors."
        },
        {
          "path": "frontend/src/api/matches.ts",
          "operation": "create",
          "description": "Add React Query hooks for matches/likes lists (getMatches) and expose derived empty/loading/error states."
        },
        {
          "path": "frontend/src/components/state/QueryStates.tsx",
          "operation": "create",
          "description": "Create shared UI helpers/components for Loading, EmptyState, and ErrorState (with Retry button) used consistently across profile, discovery, matches, and messages."
        },
        {
          "path": "frontend/src/pages/OnboardingPage.tsx",
          "operation": "modify",
          "description": "Use React Query hooks for profile create/update and render loading/error/empty states for 'no profile yet' flows."
        },
        {
          "path": "frontend/src/pages/DiscoveryPage.tsx",
          "operation": "modify",
          "description": "Use React Query for discovery loading/error/empty states (including 'no discovery results') and retry."
        },
        {
          "path": "frontend/src/pages/MatchesPage.tsx",
          "operation": "modify",
          "description": "Use React Query for matches loading/error/empty states (including 'no matches') and retry."
        },
        {
          "path": "frontend/src/pages/MessagesInboxPage.tsx",
          "operation": "modify",
          "description": "Use React Query for inbox data and implement empty state for 'no messages' (and/or no matches) with clear guidance."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Define and apply a cohesive visual theme (colors, typography, spacing, interaction patterns) across all pages.",
      "acceptanceCriteria": [
        "The UI uses a consistent color palette and typography system across landing, discovery, profile, matches, and messaging.",
        "Interactive elements (buttons, cards, inputs) share consistent styling and states (hover/disabled/loading)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Create global styles and theme tokens (CSS variables for shadcn/tailwind design system), set base typography, and define consistent spacing/interaction defaults to apply across the app."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme as needed to support the dating UI theme (e.g., brand palette tokens, shadows, radii) while keeping consistency with existing CSS variable-driven color system."
        },
        {
          "path": "frontend/src/components/layout/AuthedShell.tsx",
          "operation": "modify",
          "description": "Apply consistent layout spacing and component styling for header/nav/content areas so all signed-in pages share the same structure and interaction patterns."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Apply theme styling to landing hero, CTA, and feature sections so it visually matches the authenticated app."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Provide basic profile photo handling UX (add/remove/reorder photo URLs or static assets) and display photos in discovery and profile views.",
      "acceptanceCriteria": [
        "Users can manage at least 1–5 photos for their profile (add/remove and reorder).",
        "Discovery cards display the primary photo and allow viewing additional photos (carousel or gallery)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/PhotoManager.tsx",
          "operation": "create",
          "description": "Create a photo manager component that lets users add/remove/reorder 1–5 photo URLs (and optionally pick from known static assets), with validation and clear English helper text."
        },
        {
          "path": "frontend/src/components/profile/PhotoCarousel.tsx",
          "operation": "create",
          "description": "Create a simple photo carousel/gallery component for displaying multiple photos on discovery cards and profile views (no backend image fetching)."
        },
        {
          "path": "frontend/src/pages/OnboardingPage.tsx",
          "operation": "modify",
          "description": "Integrate PhotoManager into onboarding profile creation, ensuring saved profiles include the ordered photoUrls array."
        },
        {
          "path": "frontend/src/pages/EditProfilePage.tsx",
          "operation": "modify",
          "description": "Integrate PhotoManager into edit profile and ensure updates persist photo add/remove/reorder changes."
        },
        {
          "path": "frontend/src/pages/DiscoveryPage.tsx",
          "operation": "modify",
          "description": "Display the primary photo prominently and allow viewing additional photos using PhotoCarousel within the discovery card UI."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add onboarding terms/consent gating (18+ and community guidelines) before activating a profile for discovery.",
      "acceptanceCriteria": [
        "Onboarding includes an 18+ confirmation and guidelines agreement checkbox.",
        "Users who do not accept cannot activate their profile or appear in discovery."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OnboardingPage.tsx",
          "operation": "modify",
          "description": "Add required consent UI (18+ confirmation + guidelines agreement) and ensure the profile activation flow only proceeds when both are checked; pass the consent flag to the backend update flow."
        },
        {
          "path": "frontend/src/pages/DiscoveryPage.tsx",
          "operation": "modify",
          "description": "If the signed-in user is missing a profile or has not agreed to terms/is not active, show a clear call-to-action to complete onboarding instead of showing discovery data."
        },
        {
          "path": "frontend/src/api/profile.ts",
          "operation": "modify",
          "description": "Ensure profile mutation helpers accept and forward the confirmTerms/activation flag required by the backend update flow, and normalize consent-related errors into friendly English messages."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Include required generated static images under frontend/public/assets/generated and reference them directly in the UI.",
      "acceptanceCriteria": [
        "The generated images are present under frontend/public/assets/generated and referenced directly by the frontend.",
        "The landing page displays the generated hero image and the app uses the generated logo asset in the header/branding."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/dating-hero.dim_1600x900.png",
          "operation": "create",
          "description": "Add the generated hero illustration asset at frontend/public/assets/generated/dating-hero.dim_1600x900.png and reference it directly from the landing page UI (no backend fetching)."
        },
        {
          "path": "frontend/public/assets/generated/dating-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated logo asset at frontend/public/assets/generated/dating-logo.dim_512x512.png and use it for header/branding in the authenticated shell and landing page."
        },
        {
          "path": "frontend/public/assets/generated/dating-icons.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated icons sprite/image at frontend/public/assets/generated/dating-icons.dim_256x256.png and wire it into navigation and/or feature highlights as needed."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Render the hero image from frontend/public/assets/generated/dating-hero.dim_1600x900.png and ensure the page remains public and does not require authentication."
        },
        {
          "path": "frontend/src/components/layout/AuthedNav.tsx",
          "operation": "modify",
          "description": "Render the logo from frontend/public/assets/generated/dating-logo.dim_512x512.png in the signed-in header and optionally use frontend/public/assets/generated/dating-icons.dim_256x256.png for nav icons."
        }
      ]
    }
  ]
}